In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./data/gapminder.tsv', sep = '\t')

In [6]:
head.df

NameError: name 'head' is not defined

In [12]:
display(df.head())

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [14]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [15]:
df.index

RangeIndex(start=0, stop=1704, step=1)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
country      1704 non-null object
continent    1704 non-null object
year         1704 non-null int64
lifeExp      1704 non-null float64
pop          1704 non-null int64
gdpPercap    1704 non-null float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [17]:
df['country'] #subsetting one element from the table

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
5       Afghanistan
6       Afghanistan
7       Afghanistan
8       Afghanistan
9       Afghanistan
10      Afghanistan
11      Afghanistan
12          Albania
13          Albania
14          Albania
15          Albania
16          Albania
17          Albania
18          Albania
19          Albania
20          Albania
21          Albania
22          Albania
23          Albania
24          Algeria
25          Algeria
26          Algeria
27          Algeria
28          Algeria
29          Algeria
           ...
1674    Yemen, Rep.
1675    Yemen, Rep.
1676    Yemen, Rep.
1677    Yemen, Rep.
1678    Yemen, Rep.
1679    Yemen, Rep.
1680         Zambia
1681         Zambia
1682         Zambia
1683         Zambia
1684         Zambia
1685         Zambia
1686         Zambia
1687         Zambia
1688         Zambia
1689         Zambia
1690         Zambia
1691         Zambia
1692       Zimbabwe
1693       Zimbabwe
1694       Zimbabwe
1695       Zimbabwe
1696       Zimbabwe
1697       Zimbabwe
1698       Zimbabwe
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [21]:
country_df = df['country']

In [24]:
display(country_df.head())

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [25]:
type(country_df) #if the table is the dataframe, every column is one serious

pandas.core.series.Series

In [27]:
subset = df[['country', 'continent', 'year']] #[] is used to pull one element form a data frame,
#[''] si a list in a dataframe

In [29]:
display(subset.head())

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [36]:
pd.__version__  #the version of the current pandas, important when you google something

'0.24.2'

In [37]:
df.loc[2] # location of second index element, not the second row (lablled index )

country      Afghanistan
continent           Asia
year                1962
lifeExp           31.997
pop             10267083
gdpPercap        853.101
Name: 2, dtype: object

In [38]:
df.loc[[2]] # get a row function

       country continent  year  lifeExp       pop  gdpPercap
2  Afghanistan      Asia  1962   31.997  10267083  853.10071

In [39]:
df.loc[[0,1]] #get multiple row function

       country continent  year  lifeExp      pop   gdpPercap
0  Afghanistan      Asia  1952   28.801  8425333  779.445314
1  Afghanistan      Asia  1957   30.332  9240934  820.853030

In [40]:
df.iloc[2] # get the row in the index position 2

country      Afghanistan
continent           Asia
year                1962
lifeExp           31.997
pop             10267083
gdpPercap        853.101
Name: 2, dtype: object

In [42]:
subset2 = df.loc[:,['year ', 'pop']] # : means get all the rows [ get rows, get columns]

In [43]:
display(subset2.head())

   year        pop
0    NaN   8425333
1    NaN   9240934
2    NaN  10267083
3    NaN  11537966
4    NaN  13079460

In [45]:
subset3 = df.loc[df['year'] == 1967, ['year', 'pop']] # filter all the rows of with year value of 1967 and subset
#column 'year' and 'pop'

In [46]:
display(subset3.head())

    year       pop
3   1967  11537966
15  1967   1984060
27  1967  12760499
39  1967   5247469
51  1967  22934225

In [57]:
subset4 = df.loc[(df['year'] == 1967) & (df['pop'] > 100000), ['year', 'pop']] # multiple row saparate (), &, | (or)

In [59]:
display(subset4.head())

    year       pop
3   1967  11537966
15  1967   1984060
27  1967  12760499
39  1967   5247469
51  1967  22934225